package task_5;

public class AccessModifiers {
    /**
     * Oracle: Модифікатори доступу.
     * https://docs.oracle.com/javase/tutorial/java/javaOO/accesscontrol.html
     * https://docs.oracle.com/javase/tutorial/java/javaOO/variables.html
     * Модифікатори доступу – це ключові слова, які задають оголошену доступність члена або типу.
     * За допомогою модифікаторів доступу можна встановити такі рівні доступності:
     * • private – клас, метод, поле тощо, які оголошені як private можуть бути доступні лише у класі, де оголошені.
     * • default (package-private) – клас, метод, поле тощо, які не мають ніякого модифікатора доступу,
     * можуть бути доступні тільки в межах пакета, де клас був оголошений.
     * • protected – клас, метод, поле тощо, які оголошені як protected, можуть бути доступні тільки для
     * класів-спадкоємців (subclasses) та в межах пакета, де клас оголошений.
     * • public – клас, метод, поле тощо, які оголошені як public, можуть бути доступні з будь-якого іншого класу.
     * Ключове слово – final, яке запобігає наслідуванню.
     * Якщо клас позначений final (фінальний), компілятор не дозволить успадковувати від нього.
     * Прийнято, що клас герметизований чи «запечатаний».
     */
}
