package task_5;

public class Inheritance {
    /**
     * Oracle: Успадкування.
     * https://docs.oracle.com/javase/tutorial/java/IandI/subclasses.html
     * Успадкування — механізм об'єктно-орієнтованого програмування, що дозволяє описати новий (похідний) клас
     * на основі вже існуючого (базового), при цьому властивості та функціональність базового класу запозичуються
     * новим похідним класом.
     * За винятком Object, який не має суперкласу, кожен клас має один і тільки один прямий суперклас.
     * Без будь-якого іншого явного суперкласу кожен клас неявно є підкласом Object.
     * Клас Object, визначений в java.lang пакеті, визначає та реалізує поведінку, спільну для всіх класів, включаючи
     * написані вами. У платформі Java багато класів є похідними безпосередньо від Object, інші класи є похідними від
     * деяких з цих класів і так далі, утворюючи ієрархію класів.
     * Підклас не успадковує приватних членів свого батьківського класу.
     * Однак, якщо суперклас має загальнодоступні або захищені методи для доступу до його закритих полів,
     * вони також можуть використовуватися підкласом.
     */
}
