package task_5;

public class Polymorphism {
    /**
     * Oracle: Поліморфізм.
     * https://docs.oracle.com/javase/tutorial/java/IandI/polymorphism.html
     * Поліморфізм – можливість об'єктів з однаковою специфікацією мати різну реалізацію.
     * Поліморфізм надає підкласу спосіб визначення власної версії методу, визначеного у його базовому класі,
     * з використанням процесу, який називається перевизначенням методу (method
     * overriding).
     * Базові класи можуть визначати та реалізовувати методи, а похідні класи можуть перевизначати
     * їх. Це означає, що вони надають власні визначення та реалізацію.
     * Якщо похідний клас успадковує від базового класу, він набуває всі методи, поля, властивості та
     * події базового класу. Проєктувальник похідного класу може вибирати з таких можливостей:
     * 1) перевизначити члени у базовому класі;
     * 2) успадкувати метод останнього базового класу без його перевизначення;
     * 3) визначити нову реалізацію цих членів, яка приховує реалізацію базового класу.
     * Якщо у похідному класі метод перевизначається, цей член викликається навіть у тому випадку, якщо доступ до
     * екземпляра цього класу здійснюється як до екземпляра базового класу.
     * Існує ключове слово super, за допомогою якого можна викликати метод базового класу, напр. super.method();
     * і потіперевизначити метод базового класу можна викликати метод базового класу
     */
}
